app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    @artist = Artist.find_by(id: params[:artist_id])
      if params[:artist_id] && @artist
        @songs = @artist.songs
      elsif !params[:artist_id].present?
        @songs = Song.all